# Что такое переменная в python?
# перееменная это своего  рода стикер прикрепляеемы на объект с ппомощью = (оператор присвоения)

# Что такое счётчик ссылок и зачем он используется?
# Счетчик ссылок слеедит за колличеством созданных объектов и удаляет не нужные 


# Какие основные типы данных есть в Python?
# Основными типами данных Python являются: числа (int, float, complex)
# Строки (str)
# Списки (list, tuple, range)
# Словари (dict)
# Логический (bool)
# Множество (set, frozenset)


# Как можно преобразовать данные из одного типа в другой?
# Для преобразования типов используются функции, имена которых совпадают с именами типов
